ОтображениеГрафов/src/Catalogs/граф_ШаблоныЭлементов/граф_ШаблоныЭлементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>граф_ШаблоныЭлементов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПредопределенныеТипыОформления</name>
      <description>Предопределенные типы оформления</description>
      </content>
      </content>
    </items>
  </predefined>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>EnumRef.граф_КомпонентыГрафа</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеJS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ОтображениеГрафов/src/Catalogs/граф_ШаблоныЭлементов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакешироватьДанныеССервера();
	НастроитьВнешнийВидФормы();
	ПодготовитьРедакторСвойств();
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	граф_РаботаСФайламиКлиент.ПроверитьиУстановитьБиблиотеку("x6");
	СформироватьКодДляПросмотраЭлемента();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.Код;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипЭлементаПриИзменении(Элемент)
	ТипЭлементаПриИзмененииНаСервере();
	СформироватьКодДляПросмотраЭлемента();
КонецПроцедуры


&НаКлиенте
Процедура ОписаниеЭлементаJSПриИзменении(Элемент)
	СформироватьКодДляПросмотраЭлемента();
КонецПроцедуры


&НаКлиенте
Процедура РедакторСвойствПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Сообщить(123);
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура Команда1(Команда)
	Объект.ОписаниеJS = Элементы.РедакторСвойств.Документ.defaultView.parent.exportJSON(); 
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗакешироватьДанныеССервера()
	КешированныйШаблонТекстаСтраницы = граф_МакетыВызовСервера.ТекстМакета("граф_HTMLШаблонЭлемента");
	КешированныйТекстСоставляющего = Перечисления.граф_КомпонентыГрафа.ОписаниеКомпонентаГрафа(Объект.Компонент);
КонецПроцедуры

&НаСервере
Процедура НастроитьВнешнийВидФормы()
	Если Объект.Предопределенный Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКодДляПросмотраЭлемента()
	Если Не ЗначениеЗаполнено(КаталогВременныхФайлов) Тогда
		ОповещениеОСоздании = Новый ОписаниеОповещения("ПослеСозданияКаталогаВременныхФайлов", ЭтотОбъект);
		ФайловаяСистемаКлиент.СоздатьВременныйКаталог(ОповещениеОСоздании, "js");
	Иначе
		ПослеСозданияКаталогаВременныхФайлов(КаталогВременныхФайлов);
	КонецЕсли;
	
//	ШаблонТекстаСтраницы = СтрЗаменить(КешированныйШаблонТекстаСтраницы, ЧтоИщем, ЧтоИщем + Символы.ПС + КешированныйТекстСоставляющего);
//	
//	Если ЗначениеЗаполнено(Объект.ОписаниеJS) Тогда
//		ЧтоИщем = "<!-- Регистрация собственных типов -->";
//		ШаблонТекстаСтраницы = СтрЗаменить(ШаблонТекстаСтраницы, ЧтоИщем, ЧтоИщем + Символы.ПС + Объект.ОписаниеJS);
//	КонецЕсли;
	
	//ШаблонТекстаСтраницы = СтрЗаменить(КешированныйТекстСоставляющего, "x6.js", граф_РаботаСФайламиКлиент.ПутьКБиблиотеке("x6"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияКаталогаВременныхФайлов(Результат, ДопПараметры = Неопределено) Экспорт
	Если ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат ;
	КонецЕсли;
	КаталогВременныхФайлов = Результат; 
	РазделительПути = ПолучитьРазделительПутиКлиента();
	ПутьКФайлу = СтрШаблон("%1%2%3", КаталогВременныхФайлов, РазделительПути, "data.js"); 
	СодержимоеФайла = СтрЗаменить(КешированныйТекстСоставляющего, "shape-type", Объект.Код);
	граф_РаботаСФайламиКлиент.СоздатьТекстовыйФайл(ПутьКФайлу, СодержимоеФайла);
	ШаблонТекстаСтраницы = СтрЗаменить(КешированныйШаблонТекстаСтраницы, "x6.js", граф_РаботаСФайламиКлиент.ПутьКБиблиотеке("x6"));
	ШаблонТекстаСтраницы = СтрЗаменить(ШаблонТекстаСтраницы, "data.js", ПутьКФайлу);
	ВнешнийВид = ШаблонТекстаСтраницы;
КонецПроцедуры

&НаСервере
Процедура ТипЭлементаПриИзмененииНаСервере()
	КешированныйТекстСоставляющего = Перечисления.граф_КомпонентыГрафа.ОписаниеКомпонентаГрафа(Объект.Компонент);
КонецПроцедуры

&НаСервере
Процедура ПодготовитьРедакторСвойств()
	ОсновнойТекст = Справочники.граф_ШаблоныЭлементов.ПолучитьМакет("HTMLРедактированиеСвойствЭлемента").ПолучитьТекст();
	ОсновнойКод = Справочники.граф_ШаблоныЭлементов.ПолучитьМакет("JsГенераторФормы").ПолучитьТекст();
	Схема = Справочники.граф_ШаблоныЭлементов.ПолучитьМакет("JsСхема").ПолучитьТекст();
	ШаблонКода = "<SCRIPT>
		|%1
		|</SCRIPT>";
	КодГенератора = СтрШаблон(ШаблонКода, ОсновнойКод);	
	КодСхемы = СтрШаблон(ШаблонКода, Схема);
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "<script src=""schema-generator.js""></script>", КодГенератора);
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "<script src=""schema-data.js""></script>", КодСхемы);
	РедакторСвойств = ОсновнойТекст;
КонецПроцедуры
#КонецОбласти
